{
  "album": {
    "name": "The Rebirth of Dissection",
    "artist": "Dissection",
    "url": "https://www.last.fm/music/Dissection/The+Rebirth+of+Dissection",
    "image": [
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/34s/a416887c4f3d4ff391029ef9f7e6a165.png",
        "size": "small"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/64s/a416887c4f3d4ff391029ef9f7e6a165.png",
        "size": "medium"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/174s/a416887c4f3d4ff391029ef9f7e6a165.png",
        "size": "large"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/a416887c4f3d4ff391029ef9f7e6a165.png",
        "size": "extralarge"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/a416887c4f3d4ff391029ef9f7e6a165.png",
        "size": "mega"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/a416887c4f3d4ff391029ef9f7e6a165.png",
        "size": ""
      }
    ],
    "listeners": "4016",
    "playcount": "115217",
    "tracks": {
      "track": []
    },
    "tags": {
      "tag": []
    },
    "wiki": {
      "published": "24 May 2009, 20:31",
      "summary": "The Rebirth of Dissection - there's an ironically nostalgic aura surrounding the title of Sweden's extreme Metal pioneers' first and last live DVD recording. Sadly, this rebirth wouldn't last long as the band (complete with a new line-up) had already announced they would dismantle following the release of their new album \"Reinkaos\" in 2006. Dissection's final statement would come in August with long-standing frontman Jon Nodtveidt ending his own life. <a href=\"http://www.last.fm/music/Dissection/The+Rebirth+of+Dissection\">Read more on Last.fm</a>.",
      "content": "The Rebirth of Dissection - there's an ironically nostalgic aura surrounding the title of Sweden's extreme Metal pioneers' first and last live DVD recording. Sadly, this rebirth wouldn't last long as the band (complete with a new line-up) had already announced they would dismantle following the release of their new album \"Reinkaos\" in 2006. Dissection's final statement would come in August with long-standing frontman Jon Nodtveidt ending his own life.\n\nUnless you've been living in North Korea for the past decade or so, most of you will know the story behind Dissection. From the melodic Death/Black Metal masterpieces of \"The Somberlain\" (1993) and \"Storm of the Light's Bane\" (1995) to Jon Nodtveidt's murder conviction and subsequent incarceration in 1997, needless to say, the band has been through more than a few ups and downs, with only founding member Nodtveidt remaining of the original line-up.\n\nReleased from prison in September 2004, Nodtveidt assembled a new crew, and the assault of the newly born Anti-Cosmic Metal of Death (as Jon describes it) could begin.\n\nRecorded in front of a sold-out arena in Stockholm, on October 30th, 2004, Dissection performed their first show in over 7 years. And it was all captured on video. The DVD is comprised of the concert itself, a video for \"Starless Aeon\" (a song from the new album \"Reinkaos\"), a very neatly done photo slideshow of the concert, as well as an exclusive 25-minute interview with Nodvtveidt himself.\n\nThe tracklisting is just what any Dissection has been craving for: 15 songs with \"Storm of the Light's Bane\" played in full ( hell yes! ), plus the rest of the classics including \"The Somberlain\", \"Heaven's Damnation\" , \"A Land Forlorn\" and the ever-grabbing Tormentor-cover \"Elizabeth Bathori\".\n\nA hint towards the band's newer \"Anti-Cosmic\" sound is delivered in the form of \"Maha Kali,\" a very catchy tune indeed, during which the live audience understandably takes a breath for actual listening purposes.\n\nThe various camera angles used to capture the show are well planned and the sound quality is top-notch.\n\nThe audience itself is just what you'd expect from people who've been waiting for Dissection's first stage-appearance after so many years: filled with adrenaline, entranced and singing along to every single track from the classic opener \"Night's Blood\" onwards. The band is greeted with wild shouts and roaring applause from the moment they walk on to the stage, which pretty much goes on for the ensuing 90 minutes. Not surprisingly, by the time \"Where Dead Angels Lie\" hits in, the crowd is already in a pulverized state.\n\nNodtveidt raises his fists into the air after almost every song almost as if to say \"We're back. So join us or die !\" and the late Dissection frontman is greeted with divine-like respect from everyone in the audience. He is a true master at his craft. He doesn't talk all that much in between songs, but the music speaks for itself.\n\nWhat can I say? Rebirth of Dissection documents an awesome concert from start to finish and is an absolute treasure to any loyal Dissection fan (such as yours truly).\n\nThe video for \"Starless Aeon\" is well done and is a worthy representation of the new Dissection. Watching it, one can't help but feel frustrated that yet again (permanently this time) Dissection is no more.\n\nIn the interview-section of the DVD, Jon talks about his music, personal beliefs, society as he sees it, the long path of Dissection, as well as his years in prison, which all makes for very interesting listening.\n\nRebirth of Dissection is definitely a must-see for those wishing to dig deeper into the ideology and driving force behind the man who embodied Dissection. Needless to say, Jon Nodtveidt was one of the most influential and talented extreme metal musicians to ever emerge.\n\nSo there we have it. A rebirth short-lived, but one which showed why Dissection will forever remain the unrivalled masters of extreme Nordic metal. Who will replace their throne? No one, in a very long time. Believe me. <a href=\"http://www.last.fm/music/Dissection/The+Rebirth+of+Dissection\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  },
  "createdAt": "2021-01-11T12:00:23.369Z"
}
