{
  "album": {
    "name": "Telepathic With the Deceased",
    "artist": "Xasthur",
    "mbid": "bb36ae6a-88dd-45d7-8e3f-46706708d220",
    "url": "https://www.last.fm/music/Xasthur/Telepathic+With+the+Deceased",
    "image": [
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/34s/8d14ae2db054dc6d69462cf302ca646a.png",
        "size": "small"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/64s/8d14ae2db054dc6d69462cf302ca646a.png",
        "size": "medium"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/174s/8d14ae2db054dc6d69462cf302ca646a.png",
        "size": "large"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/8d14ae2db054dc6d69462cf302ca646a.png",
        "size": "extralarge"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/8d14ae2db054dc6d69462cf302ca646a.png",
        "size": "mega"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/8d14ae2db054dc6d69462cf302ca646a.png",
        "size": ""
      }
    ],
    "listeners": "24028",
    "playcount": "383380",
    "tracks": {
      "track": [
        {
          "name": "Entrance Into Nothingness",
          "url": "https://www.last.fm/music/Xasthur/_/Entrance+Into+Nothingness",
          "duration": "230",
          "@attr": {
            "rank": "1"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "Slaughtered Useless Beings in a Nihilistic Dream",
          "url": "https://www.last.fm/music/Xasthur/_/Slaughtered+Useless+Beings+in+a+Nihilistic+Dream",
          "duration": "289",
          "@attr": {
            "rank": "2"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "Abysmal Depths Are Flooded",
          "url": "https://www.last.fm/music/Xasthur/_/Abysmal+Depths+Are+Flooded",
          "duration": "411",
          "@attr": {
            "rank": "3"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "May Your Void Become as Deep as My Hate",
          "url": "https://www.last.fm/music/Xasthur/_/May+Your+Void+Become+as+Deep+as+My+Hate",
          "duration": "207",
          "@attr": {
            "rank": "4"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "Telepathic With the Deceased",
          "url": "https://www.last.fm/music/Xasthur/_/Telepathic+With+the+Deceased",
          "duration": "583",
          "@attr": {
            "rank": "5"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "A Walk Beyond Utter Blackness (Instrumental)",
          "url": "https://www.last.fm/music/Xasthur/_/A+Walk+Beyond+Utter+Blackness+(Instrumental)",
          "duration": "461",
          "@attr": {
            "rank": "6"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "Cursed Revelations",
          "url": "https://www.last.fm/music/Xasthur/_/Cursed+Revelations",
          "duration": "339",
          "@attr": {
            "rank": "7"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "Drown Into Eternal Twilight",
          "url": "https://www.last.fm/music/Xasthur/_/Drown+Into+Eternal+Twilight",
          "duration": "180",
          "@attr": {
            "rank": "8"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "Murdered Echoes of the Mind",
          "url": "https://www.last.fm/music/Xasthur/_/Murdered+Echoes+of+the+Mind",
          "duration": "603",
          "@attr": {
            "rank": "9"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        },
        {
          "name": "Exit",
          "url": "https://www.last.fm/music/Xasthur/_/Exit",
          "duration": "153",
          "@attr": {
            "rank": "10"
          },
          "streamable": {
            "#text": "0",
            "fulltrack": "0"
          },
          "artist": {
            "name": "Xasthur",
            "mbid": "39e92581-e59d-4070-b157-abadd9969f3f",
            "url": "https://www.last.fm/music/Xasthur"
          }
        }
      ]
    },
    "tags": {
      "tag": [
        {
          "name": "black metal",
          "url": "https://www.last.fm/tag/black+metal"
        },
        {
          "name": "albums I own",
          "url": "https://www.last.fm/tag/albums+I+own"
        },
        {
          "name": "depressive black metal",
          "url": "https://www.last.fm/tag/depressive+black+metal"
        },
        {
          "name": "doom metal",
          "url": "https://www.last.fm/tag/doom+metal"
        },
        {
          "name": "dark",
          "url": "https://www.last.fm/tag/dark"
        }
      ]
    },
    "wiki": {
      "published": "20 Dec 2015, 17:34",
      "summary": "There's something about the USBM band Xasthur that everyone just loves to hate. Every single time this band gets mentioned it's usually someone trashing them, saying how boring they are and how they're by far the worst representation of the black metal scene in the United States. To tell you the truth, I really don't see the reason for all the hate whatsoever, at least on Telepathic With the Deceased. Alright, so Xasthur isn't the most original band you'll find <a href=\"http://www.last.fm/music/Xasthur/Telepathic+With+the+Deceased\">Read more on Last.fm</a>.",
      "content": "There's something about the USBM band Xasthur that everyone just loves to hate. Every single time this band gets mentioned it's usually someone trashing them, saying how boring they are and how they're by far the worst representation of the black metal scene in the United States. To tell you the truth, I really don't see the reason for all the hate whatsoever, at least on Telepathic With the Deceased. Alright, so Xasthur isn't the most original band you'll find, nor the greatest and they have had some below-average albums, but they sure as hell get the job done if you're in the mood for something nihilistic and hateful, that's for damn sure. By the sounds of that description you probably could've guessed that this band opts for the more suicidal and/or depressing side of the black metal genre. Usually you'll see this band compared to U.S. counterparts Leviathan. Malefic, who is the only member of Xasthur, and Wrest, the sole member of Leviathan, have worked together on several occasions and yes there music is very similar. But there are some key differences so don't think this is just a Leviathan clone. \n\nFirst of all, the thing you'll either love or hate about this album is the way the vocals are produced. They're the lowest thing in the mix and they're pretty much completely buried underneath the sound of the guitars and drums. Can this possibly be a bad thing? Yes. Does it take away from the album? No, not at all. If you're not used to muddy production then you're going to have a hard time with this album. It's as simple as that. The effects on Malefic's vocals have them so far buried underneath everything that you have to pay attention for the whole duration of the album to really hear them and form an opinion on them. Once you do that, you'll realize that it's actually a really good vocal performance. The sound of his voice varies at points on this album. Normally you'll hear an extremely distorted shriek, not that uncommon in black metal, but executed very well and the distortion adds a nice unique touch. Another thing you'll hear is an extremely, literally demonic sounding growl, which also has the distortion effect to it. That vocal style is most prominent on the title track and is a nice change of pace if you're for some reason getting tired of the shrieks.\n\nInstrumentally, Malefic really knows how to put you into that trance like state. It might get tiresome over the course of 6 or 7 albums, but for this album he does an excellent job. There's no more than one or two riffs presented to the listener in each song, but they certainly do what they're meant to do, which is create an atmosphere. There's also a doom influence, which isn't too uncommon in depressive black metal such as this. Take for example the riff on May Your Void Become as Deep as My Hate! Now it's the only riff on the song, but the melancholic vibe you get from that opening riff all the way through the end of the song is absolutely intoxicating and is probably the best riff you'll hear on this album. One thing you will notice about this album is that the drumming really doesn't have too much of an effect. It's just basic stuff to keep the rhythm of the album in order. But hey, you don't need technical drumming in this type of music, so it gets the job done just as well. I'm not going to get too much into the lyrics, but all you need to know if you're not familiar with this genre is that they lyrics are all about suicide, depression, and hate for mankind. So if you're not in the mood to listen to something that will make you feel like that, then move on to another album.\n\nLike I mentioned earlier, this album isn't something that is going to revolutionize the black metal genre nor will it be an album that people will look back on as one of the greatest. But this is a pretty great album in it's own right and it accomplishes everything it means to accomplish and the flack that this band gets really isn't deserved all that much. They have had some bad releases, but Telepathic With the Deceased is the best album in their catalogue and fans of this type of black metal will most likely enjoy it. Some people might find it to be a demanding listen because of the length, which is just under an hour, but the time isn't really a factor at all. If you're able to go into that hypnotic state like you're meant to do then it won't seem like it's that long whatsoever. <a href=\"http://www.last.fm/music/Xasthur/Telepathic+With+the+Deceased\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  },
  "createdAt": "2021-01-11T12:15:44.073Z"
}
