{
  "album": {
    "name": "Deus Salutis Meæ",
    "artist": "Blut aus Nord",
    "url": "https://www.last.fm/music/Blut+aus+Nord/Deus+Salutis+Me%C3%A6",
    "image": [
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/34s/fa7f4e7f80f027bd2fbe7d23a48ce024.png",
        "size": "small"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/64s/fa7f4e7f80f027bd2fbe7d23a48ce024.png",
        "size": "medium"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/174s/fa7f4e7f80f027bd2fbe7d23a48ce024.png",
        "size": "large"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fa7f4e7f80f027bd2fbe7d23a48ce024.png",
        "size": "extralarge"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fa7f4e7f80f027bd2fbe7d23a48ce024.png",
        "size": "mega"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fa7f4e7f80f027bd2fbe7d23a48ce024.png",
        "size": ""
      }
    ],
    "listeners": "1361",
    "playcount": "40062",
    "tracks": {
      "track": []
    },
    "tags": {
      "tag": [
        {
          "name": "2017",
          "url": "https://www.last.fm/tag/2017"
        },
        {
          "name": "black metal",
          "url": "https://www.last.fm/tag/black+metal"
        },
        {
          "name": "metal",
          "url": "https://www.last.fm/tag/metal"
        },
        {
          "name": "industrial metal",
          "url": "https://www.last.fm/tag/industrial+metal"
        },
        {
          "name": "atmospheric black metal",
          "url": "https://www.last.fm/tag/atmospheric+black+metal"
        }
      ]
    },
    "wiki": {
      "published": "16 Jan 2018, 22:38",
      "summary": "Deus salutis meæ (also spelt Deus salutis meae) is an album by the French industrial black metal band Blut aus Nord, released in 2017. Excluding split albums and EPs, it is their twelfth full-length album. The album title is Latin for God of My Salvation, and the track listing is as follows:\n\n1. δημιουργός - 1:20\t\n2. Chorea Macchabeorum - 4:12\t\n3. Impius - 4:07\t\n4. γνῶσις - 1:27\t\n5. Apostasis - 5:28\t\n6. Abisme - 2:44\t\n7. Revelatio - 4:19\t <a href=\"http://www.last.fm/music/Blut+aus+Nord/Deus+Salutis+Me%C3%A6\">Read more on Last.fm</a>.",
      "content": "Deus salutis meæ (also spelt Deus salutis meae) is an album by the French industrial black metal band Blut aus Nord, released in 2017. Excluding split albums and EPs, it is their twelfth full-length album. The album title is Latin for God of My Salvation, and the track listing is as follows:\n\n1. δημιουργός - 1:20\t\n2. Chorea Macchabeorum - 4:12\t\n3. Impius - 4:07\t\n4. γνῶσις - 1:27\t\n5. Apostasis - 5:28\t\n6. Abisme - 2:44\t\n7. Revelatio - 4:19\t\n8. ἡσυχασμός - 1:05\t\n9. Ex tenebrae lucis - 5:09\t\n10. Métanoïa - 3:52\n\nEvery song title on this album is derived from a foreign language, though many have direct English-language descendants. Five titles are ancient Greek (of which three, the tracks that serve as interludes on the album, are actually written in the Greek alphabet, while the other two are written in the Latin alphabet), four are Latin, and one is Old/Middle French. Tentative translations and explanations (which may benefit from the attentions of people with deeper knowledge of these languages):\n\n1. δημιουργός (dimiourgós) - Ancient Greek for creator. The English word demiurge is a direct linguistic descendant of this word.\n2. Chorea Macchabeorum - Appears to be Latin meaning either \"Macabre Dance\" (i.e., the Danse Macabre, the Dance of Death) or \"Dance of the Maccabees\".\n3. Impius - Latin term meaning wicked, accursed, disloyal, unpatriotic, or impious, the last of which is a direct linguistic descendant of this word.\n4. γνῶσις (gnósis) - ancient Greek for knowledge. Again, the English word gnosis is a direct linguistic descendant of this word.\n5. Apostasis - Greek word (ἀπόστασις) that could have several meanings, including distance, length, duration, departure, revolt, or apostasy (again, the latter of these is its direct linguistic descendant). Given the other titles on the album, apostasy is likely the band's intended meaning.\n6. Abisme - Old French for hell; Middle French for abyss. (There are also Catalan, Portuguese, and Spanish words with this spelling that are linguistically related to abyss, but as the band is French, it's likeliest they intended it to be Old/Middle French.)\n7. Revelatio - Latin term meaning revelation (again, its linguistic descendant).\n8. ἡσυχασμός (hesychasmós) - Ancient Greek for quietism. In addition, the religious term hesychasm, used for a form of meditation in Eastern Orthodox Christianity, is directly descended from this word.\n9. Ex tenebrae lucis - Latin for \"From the Darkness, Light\", or \"Out of Darkness, Light\", though the grammar is apparently not wholly correct.\n10. Métanoïa - ancient Greek word (μετᾰ́νοιᾰ) meaning repentance or afterthought. The English word metanoia, meaning a fundamental change of mind or a spiritual conversion, is derived from this word.\n\nThe album is tagged as Deus salutis meae on the band's official Bandcamp site, but the description and album cover both spell the title as Deus salutis meæ (though it is written in all caps on the cover, as DEUS SALUTIS MEÆ). The ligature æ was not used in classical Latin nor is it currently in common usage, but it was used in medieval and early modern Latin writings. Also notable is that meae is a feminine pronoun (it could be either the genitive or dative singular, or the nominative or vocative plural). <a href=\"http://www.last.fm/music/Blut+aus+Nord/Deus+Salutis+Me%C3%A6\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  },
  "createdAt": "2021-01-11T12:08:14.983Z"
}
