{
  "album": {
    "name": "Stranger Fruit",
    "artist": "Zeal & Ardor",
    "url": "https://www.last.fm/music/Zeal+&+Ardor/Stranger+Fruit",
    "image": [
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/34s/19d9ab613bdb9c5e3541c8699f5f7df3.png",
        "size": "small"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/64s/19d9ab613bdb9c5e3541c8699f5f7df3.png",
        "size": "medium"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/174s/19d9ab613bdb9c5e3541c8699f5f7df3.png",
        "size": "large"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/19d9ab613bdb9c5e3541c8699f5f7df3.png",
        "size": "extralarge"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/19d9ab613bdb9c5e3541c8699f5f7df3.png",
        "size": "mega"
      },
      {
        "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/19d9ab613bdb9c5e3541c8699f5f7df3.png",
        "size": ""
      }
    ],
    "listeners": "38934",
    "playcount": "1284484",
    "tracks": {
      "track": []
    },
    "tags": {
      "tag": [
        {
          "name": "2018",
          "url": "https://www.last.fm/tag/2018"
        },
        {
          "name": "blues black metal",
          "url": "https://www.last.fm/tag/blues+black+metal"
        },
        {
          "name": "black metal",
          "url": "https://www.last.fm/tag/black+metal"
        },
        {
          "name": "heavy metal",
          "url": "https://www.last.fm/tag/heavy+metal"
        },
        {
          "name": "metal",
          "url": "https://www.last.fm/tag/metal"
        }
      ]
    },
    "wiki": {
      "published": "28 Dec 2018, 12:58",
      "summary": "Stranger Fruit is the second studio album by avant-garde metal band Zeal & Ardor. It was released on June 8, 2018, through MKVA records. It is Zeal & Ardor's first release as a full band, previous releases were entirely composed by singer Manuel Gagneux, although Stranger Fruit only features drummer Marco Von Allmen from the full band alongside Gagneux.\n\nPreceded by the singles \"Gravedigger's Chant\", \"Waste\" and \"Built on Ashes\", the album was released to critical acclaim. <a href=\"http://www.last.fm/music/Zeal+&+Ardor/Stranger+Fruit\">Read more on Last.fm</a>.",
      "content": "Stranger Fruit is the second studio album by avant-garde metal band Zeal & Ardor. It was released on June 8, 2018, through MKVA records. It is Zeal & Ardor's first release as a full band, previous releases were entirely composed by singer Manuel Gagneux, although Stranger Fruit only features drummer Marco Von Allmen from the full band alongside Gagneux.\n\nPreceded by the singles \"Gravedigger's Chant\", \"Waste\" and \"Built on Ashes\", the album was released to critical acclaim. It charted on several international charts, including nearly topping the Swiss album charts at #2.\n\nManuel Gagneux announced the release of the album on March 29, 2018. The first single \"Gravedigger's Chant\" was released the same day. A second single, \"Waste\", was released on April 27, 2018. The third and final single \"Built On Ashes\", was released on May 25. The title of the album is a reference to \"Strange Fruit\" by Billie Holiday, a song about racism and lynching of African Americans. Two music videos (directed by Samuel Morris & Manuel Sieber) were released, for \"Intro\" and \"Gravedigger's Chant\".[9][10] Musically, the album is considered a continuation of the previous album Devil Is Fine.\n\nGagneux described the album title in an interview,\n\nIt's kind of a continuation of the thoughts of strange fruit, of people hanging, and, by extension, of people being shot or dying. It's not that happy of an idea, all in all. But that's kind of the times we live in.\"\n\nGagneux drew inspiration from non-metal artists such as Tom Waits, A Clockwork Orange composer Wendy Carlos and French composer Erik Satie during the writing of the album. Additionally, he listened to the field recordings of Alan Lomax. The album features references to Goetia, Yoruba, as well as obscure occult literature and history.\n\nThe album is produced by Gagneux and Zebo Adam, mixed by Kurt Ballou, and mastered by Alan Douches.\n\nThe front cover features a green Granny Smith apple almost entirely obscured by the band's logo and a purple foreground. Each single features the apple in various states of disrepair; bruised (\"Gravedigger's Chant\"), chopped in half (\"Waste\" and \"Built on Ashes\"), and with bites taken out of it (\"You Ain't Coming Back\"). The photographs of the apple were taken by drummer Marco Von Allmen.\n\nAbout the album's artwork, Gagneux stated \"We thought way too long about it, and then just thought, 'What’s a fruit?'. We just bought an apple and figured we needed to mess it up as a reference to The Beatles album and the forbidden fruit and also the poem from Billie Holiday.\"\n\nZeal & Ardor expanded to a full band after recording the previous album.\nThe first track, \"Intro\" is a short track which Gagneux states \"establishes a mood for the album to follow\". \"Gravedigger's Chant\" features the lyrics \"Bring the dead down low, Bring the dead body down to the graveyard, son. You can't run, you can't hide.\", alongside piano and gospel style vocals. Gagneux described the song, stating \"The gravedigger's chant is the song sung by the people who lay your body to rest. These people don't care where you were, but they know what you did and who loved you. All they know is what lies before them. So they sing this song, since you can no longer breathe a note.\" He also stated the song was released as the lead single because \"it's really not a metal song.. it's not typically what you would expect\". \"Servants\", described as more melodic than other tracks, and featuring tremolo guitar is about \"either a slave revolution\" or a \"message to the American Middle class\"\n\n\"Don't You Dare\" was first released in February 2017, and was performed live before being included on Stranger Fruit. Gagneux described the song as saying \"The idea of something so horrible that merely looking at it will end you is fascinating to me.. Don't You Dare thematically plays with biblical demons as well as Lovecraftian elements that lend themselves well to this idea.\" He described the song as \"portraying a different kind of character\", calling it \"commanding\".   \"Fire of Motion\" features an Aleister Crowley sample. \"The Hermit\" is one of four instrumental tracks on the album (alongside \"The Fool\", \"Solve\" and \"Coagula\"), which serve as \"breathers for your ears before the heavy parts\". \"Row Row\" is stated to have more soul elements, with Gagneux comparing it to Motown music, as well as saying it's the \"turning point in the story\" of the album. Loudwire described the song as the most blues based song by the band. \"Ship on Fire\" features occult chanting and is considered the 'second chapter' of \"Row Row\".\n\n\n\"Waste\" is a purposely contradictory song, using the Millennial whoop (a simplistic style used in many pop songs) in contrast to what Gagneux called \"The darkest song on the album\", fully incorporating the gospel and soul elements into black metal.The song features \"crackling production, hellish screams, and out-of-nowhere blastbeats\". \"You Ain't Coming Back\" was created with the intent of having a hard-hitting song without the extreme metal.[19] Gagneux used guitar string dissonance to help achieve the effect.  The song was released (alongside an instrumental version) as a single in September 2018. \"We Can't Be Found\" was the song that was worked on the longest, being described as \"a bunch of riffs and beats we managed to amalgamate into something cohesive\". \"Stranger Fruit\" was written with the intent of making a song difficult to listen to because of the lyrical narrative of the song  \"Built On Ashes\" references Strange Fruit, with the lyrics \"like a strange fruit out of season, You are bound to die alone, And you will swing free in the breeze then.\" The song was written as a \"bittersweet ending\" to the album, as a way to summarize the entire album.\n\nManuel Gagneux – lead vocals, backing vocals, lead guitar, rhythm guitar, bass guitar, synthesizer, samples, programming, production\nMarco Von Allmen – drums (all tracks except 6, 11, 14 and 15), cover photography, artwork <a href=\"http://www.last.fm/music/Zeal+&+Ardor/Stranger+Fruit\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  },
  "createdAt": "2021-01-11T12:14:16.530Z"
}
